Tekla Open API Reference for Tekla Structures 2025
PluginCoordinateSystemAttribute Constructor (PluginBase.CoordinateSystemType)
 The custom attribute used to define coordinate system of the plug-in. This is not to be used by itself.
 Namespace: Tekla.Structures.Plugins
 Assembly: Tekla.Structures.Plugins (in Tekla.Structures.Plugins.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public PluginCoordinateSystemAttribute(
	PluginBase.CoordinateSystemType Type
)
Public Sub New (
	Type As PluginBase.CoordinateSystemType
)
Parameters
Type
Type: Tekla.Structures.Plugins.PluginBase.CoordinateSystemType
The type of the input object dependency.
See Also
Reference
PluginCoordinateSystemAttribute Class
PluginCoordinateSystemAttribute Overload
Tekla.Structures.Plugins Namespace